Autodesk.Revit.DB.FailureResolution.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.FailureResolution
Defines a resolution for a failure.
Remarks:
A failure could have several permitted resolutions. List of applicable resolution types for the specific failure
is defined by the FailureDefinition, actual FailureResolutions are instantiated with the FailureMessage before it is posted.
Multiple resolutions per failure are allowed, although Revit UI only uses default resolution.
Since:
2011